1521716/stm32-learning/STM32Projects/复习_2026_08_08/模块四_外部中断/简易秒表/Hardware/Timer.c
#include "stm32f10x.h"                  // Device header

uint8_t TIM2_Flag = 0;

/**
  * @brief  初始化定时器
  * @param  无
  * @retval  无
  */
void Timer_Init(void)
{
	// RCC开启时钟
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2,ENABLE);
	
	// 选择时钟源
	TIM_InternalClockConfig(TIM2);
	
	// 配置时基单元
	TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure;
	TIM_TimeBaseInitStructure.TIM_ClockDivision = TIM_CKD_DIV1;
	TIM_TimeBaseInitStructure.TIM_CounterMode = TIM_CounterMode_Up;
	TIM_TimeBaseInitStructure.TIM_Period = 1000-1;
	TIM_TimeBaseInitStructure.TIM_Prescaler = 7200-1;
	TIM_TimeBaseInitStructure.TIM_RepetitionCounter = 0;
	TIM_TimeBaseInit(TIM2,&TIM_TimeBaseInitStructure);
	
	// 选择中断通道
	TIM_ITConfig(TIM2,TIM_IT_Update,ENABLE);
	
	// 配置NVIC
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
	NVIC_InitTypeDef NVIC_InitStructure;
	NVIC_InitStructure.NVIC_IRQChannel = TIM2_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
	NVIC_Init(&NVIC_InitStructure);
	
	// 使能TIM
	TIM_Cmd(TIM2,ENABLE);
	
}

/**
  * @brief  获得中断标志
  * @param  无
  * @retval  中断标志此时值
  */
uint8_t Timer_GetFlag(void)
{
	if(TIM2_Flag == 1)
	{
		TIM2_Flag = 0;
		return 1;
	}
	return 0;
}

/**
  * @brief  中断服务函数
  * @param  无
  * @retval  无
  */
void TIM2_IRQHandler(void)
{
	if(TIM_GetITStatus(TIM2,TIM_IT_Update) == SET)
	{
		TIM2_Flag = 1;
		TIM_ClearITPendingBit(TIM2,TIM_IT_Update);
	}
}
